; ====================================================================
; Тест двукратного прерывания Таймер + PIC
; ====================================================================

; счетчик прерываний R10 = 0
LI R10 0

; Записываем адрес обработчика INT_HANDLER в IHR (SCR 5)
LI R15 INT_HANDLER
SCRW IHR R15

; Запускаем 1-й раз таймер на 32 такта с включенным прерыванием (IE=1)
LI R11 START_TIMER
CALL R11

; Бесконечный цикл ожидания прерываний
MAIN_LOOP:
RJMP MAIN_LOOP

; --------------------------------------------------------------------
; Подпрограмма запуска таймера на 32 такта с IE=1
; --------------------------------------------------------------------
START_TIMER:
LI R0 0xE010
LI R2 32
STW R2 R0 0          ; CNTD = 32

LI R3 0xE014
LI R4 2              ; CTRL: IE = 1 (bit 1), TRIG = 0 (bit 0)
STB R4 R3 0          ; Запуск отсчета
AJMP R1              ; Возврат

; --------------------------------------------------------------------
; Функция-обработчик прерываний
; --------------------------------------------------------------------
INT_HANDLER:
; Читаем вектор прерывания из POP (0xE020)
LI R5 0xE020
LDB R6 R5 0          ; Чтение POP сбрасывает PEND в PIC

; Проверяем, что пришел вектор именно от таймера (вектор 1)
LI R12 1
NE R7 R6 R12
BRNZ R7 FAIL         ; Если пришел не 1 то ошибка

; Увеличиваем счетчик полученных прерываний R10++
LI R8 1
ADD R10 R10 R8

; Проверяем, какое прерывание по счету
EQ R9 R10 R12
BRNZ R9 FIRST_INT    ; Если первое прерывание то перезапускаем таймер

LI R13 2
EQ R9 R10 R13
BRNZ R9 SECOND_INT   ; Если второе прерывание то тест пройден

RJMP FAIL            ; Больше 2 прерываний - ошибка

FIRST_INT:
; Перезапускаем таймер на 32 такта второй раз
LI R11 START_TIMER
CALL R11
RIH                  ; Возврат из прерывания в MAIN_LOOP

SECOND_INT:
_SIM_HALTI 0         ; Успех. 2 прерывания прошли корректно

FAIL:
_SIM_HALTI 1         ; Ошибка